app/Controllers/Indicadores.php

SELECT *
FROM `indicador`
---
    public function cargarDatosGrafico()
    {
        $indicador = new Indicador();
        $indicador = $indicador -> findAll();
        $dataGrafico = from($indicador) ->select(function($indicador){return array('valor' =>$indicador['valor'],'fecha' =>$indicador['fecha']);});

SELECT *
FROM `indicador`
ORDER BY `fecha` ASC
---
    public function filtrarDatosGrafico($cantidad,$desde,$hasta)
    {
        $indicador = new Indicador();
        $indicador = $indicador -> orderBy('fecha','asc') -> findAll();

        if($cantidad == 0)
        {
            if($desde != "null" && $hasta != "null")
            {
                $data = from($indicador) ->where(function($indicador) use($desde,$hasta){return $indicador['fecha'] >= $desde && $indicador['fecha'] <= $hasta;})->select(function($indicador){return array('valor' =>$indicador['valor'],'fecha' =>$indicador['fecha']);});